package com.kh.object.basic;

public class OOP {
	/*
	 	OOP(Object-Oriented Programing) : 객체지향 프로그래밍
	 	
	 	객체지향 : 세상을 객체들의 상호작용으로 모델링하여 프로그램을 구성하는 설계방식
	 	
	 	객체 : 현실에서 목적과 가치가 있어, 독립적으로 식별 가능한 것.
	 	ex) 사람, 자동차, 주문, 배송...
	 	
	 	추상화 : 문제해결에 필요한 속성과 기능만 단순화하는 과정
	 	-> 클래스(class) : 추상화를 통해 만드는 설계도(객체를 만들기 위함), 필드(변수)와 메서드(함수)
	 	-> 인스턴스 객체 : 클래스로부터 new키워드를 통해 생성한 실제 메모리를 가진 객체.
	 	
	 	추상화과정
	 	1) 내가만들려는 객체가 뭘까?
	 	2) 객체들의 공통적인 속성이 뭘까? 기능은 뭘까?
	 	3) 내가 구현하고자하는 프로그램의 목적에 맞게 선별
	 	4) 선별된 속성들을 어떤 자료형, 어떤 변수명으로 저장할 것인가
	 	
	 	ex) 식단관리프로그램
	 	1) 다이어터 정보(최지원, 김일현...)객체, 식단, 아침, 점심...
	 	2) 공통속성/기능 수집 : 이름, 나이, 키, 체중, 머리색, 달리기속도, 최종학력...
	 	3) 식단관리 -> 이름, 나이, 키, 체중...
	 	4) 이름 : String name
	 	   나이 : int age
	 	   체중 : double weight
	 	
	 */

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
