-- 문제 1.
-- '노옹철' 사원과 같은 부서(DEPT_CODE)에 속한 사원들의 사원명, 부서코드, 입사일을 조회하시오.

-- 문제 2. 
-- 회사 전체 사원의 평균 급여보다 같거나 많은 급여를 받는 사원들의 사번, 사원명, 급여를 조회하시오.

-- 문제 3. 
-- 전 직원 중 가장 적은 급여를 받는 사원의 사원명, 직급코드, 급여를 조회하시오. 

-- 문제 4. 
-- 부서명(DEPT_TITLE)이 '총무부' 또는 '마케팅부'인 부서에 속한 사원들의 사원명, 부서코드, 급여를 조회하시오.

-- 문제 5. 
-- 직급이 '과장'인 사원들 중 어느 한 명의 급여보다라도 더 많이 받는 '대리' 사원의 사원명, 직급명, 급여를 조회하시오.

-- 문제 6. 
-- 다른 사원의 관리자(MANAGER_ID)로 지정되지 않은 일반 평사원들의 사원명, 부서코드, 직급코드를 조회하시오.

-- 문제 7.
-- '유재식' 사원과 같은 부서코드, 같은 직급코드를 가지는 사원들의 사원명, 부서코드, 직급코드를 조회하시오.
-- (단, 유재식 사원 본인은 결과에서 제외할 것)

-- 문제 8. 
-- 각 직급(JOB_CODE)별로 가장 높은 급여를 받는 사원들의 사원명, 직급코드, 급여를 조회하시오.

-- 문제 9. 
-- 부서별 급여 합계가 '회사 전체 급여 총합의 20%'보다 큰 부서의 부서코드와 급여 합계를 조회하시오.

-- 문제 10.
-- 부서별 평균 급여가 가장 높은 부서에 속한 사원들의 사원명, 부서코드, 급여를 조회하시오.